app/Controllers/Ajax.php

    public function getData()

    {
        $model = new ArtikelModel();
        $data = $model->findAll();
---
SELECT *
FROM `artikel`